--Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО, Ср_оценка),
--у которых средняя оценка больше максимальной оценк(е|и) в группе 1100.
SELECT "Н_ЛЮДИ"."ИД" ,"Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО", AVG("Н_ОЦЕНКИ"."СОРТ")
FROM "Н_ЛЮДИ"
    JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
    JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
    JOIN "Н_ОЦЕНКИ" ON "Н_ОЦЕНКИ"."КОД" = "Н_ВЕДОМОСТИ"."ОЦЕНКА"
WHERE "Н_УЧЕНИКИ"."ГРУППА" = '4100'
GROUP BY "Н_ЛЮДИ"."ИД" ,"Н_ЛЮДИ"."ФАМИЛИЯ", "Н_ЛЮДИ"."ИМЯ", "Н_ЛЮДИ"."ОТЧЕСТВО"
HAVING AVG("Н_ОЦЕНКИ"."СОРТ") <  (SELECT max("Н_ОЦЕНКИ"."СОРТ") FROM ( --поставил меньше тк для больше нет
    SELECT AVG("Н_ОЦЕНКИ"."СОРТ") from "Н_ЛЮДИ"
        JOIN "Н_УЧЕНИКИ" ON "Н_ЛЮДИ"."ИД" = "Н_УЧЕНИКИ"."ЧЛВК_ИД"
        JOIN "Н_ВЕДОМОСТИ" ON "Н_ЛЮДИ"."ИД" = "Н_ВЕДОМОСТИ"."ЧЛВК_ИД"
        JOIN "Н_ОЦЕНКИ" ON "Н_ОЦЕНКИ"."КОД" = "Н_ВЕДОМОСТИ"."ОЦЕНКА"
    WHERE "Н_УЧЕНИКИ"."ГРУППА" = '1100')  );